"""
Назвемо число паліндромом, якщо воно не змінюється при
перестановці його цифр у зворотному порядку. Напишіть програму,
яка за введеною користувачем кількістю n (1 ≤ n ≤ 100000) виводить
кількість таких чисел-паліндромів, які не перевищують n.

Автор: КАСЬЯН М.А.

"""
k = int(input("Введіть число n (1 ≤ n ≤ 100000): "))
i = 1
ii = 0
while i <= k:
    a = i
    n = 0
    while a > 0:
        z = a % 10
        a //= 10
        n *= 10
        n += z
    if n == i:
        ii += 1
    i += 1
print("Кількість паліндромів, які не перевищують задане число: ", ii)